NPC.Service/OpenMasService.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="MmsImplementation" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:tns="http://tempuri.org/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:i0="http://openmas.chinamobile.com/mms" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"><wsdl:import namespace="http://openmas.chinamobile.com/mms" location="http://127.0.0.1:9090/OpenMasService?wsdl=wsdl0"/><wsdl:types/><wsdl:binding name="BasicHttpBinding_IMms" type="i0:IMms"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="SendMessage3"><soap:operation soapAction="http://openmas.chinamobile.com/mms/IMms/SendMessage3" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="SendMessage4"><soap:operation soapAction="http://openmas.chinamobile.com/mms/IMms/SendMessage4" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="GetMessage"><soap:operation soapAction="http://openmas.chinamobile.com/mms/IMms/GetMessage" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="AddTask3"><soap:operation soapAction="http://openmas.chinamobile.com/mms/IMms/AddTask3" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="AddTask4"><soap:operation soapAction="http://openmas.chinamobile.com/mms/IMms/AddTask4" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation><wsdl:operation name="RemoveTask"><soap:operation soapAction="http://openmas.chinamobile.com/mms/IMms/RemoveTask" style="document"/><wsdl:input><soap:body use="literal"/></wsdl:input><wsdl:output><soap:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="MmsImplementation"><wsdl:port name="BasicHttpBinding_IMms" binding="tns:BasicHttpBinding_IMms"><soap:address location="http://127.0.0.1:9090/OpenMasService"/></wsdl:port></wsdl:service></wsdl:definitions>