sms/彩信报文.txt

public string SendMessage(string[] destinationAddresses, string subject, string content, string extendCode, string applicationId, string password)
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><SendMessage3 xmlns="http://openmas.chinamobile.com/mms"><destinationAddresses xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:string>13429614889</a:string></destinationAddresses><subject>......</subject><content>&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;masmms&gt;&lt;content contentType="/" charset="gb2312" contentId="00000000-0000-0000-0000-000000000000" contentLocation=""&gt;xOO6w8TayN0=&lt;/content&gt;&lt;/masmms&gt;</content><extendCode>0101</extendCode><applicationId>DefaultApplication</applicationId><password/></SendMessage3></s:Body></s:Envelope>

public string SendMessage(string[] destinationAddresses, string subject, string content, string extendCode, string applicationId, string password, DateTime expectSendTime)
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><SendMessage4 xmlns="http://openmas.chinamobile.com/mms"><destinationAddresses xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:string>13429614889</a:string></destinationAddresses><subject>......</subject><content>&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;masmms&gt;&lt;content contentType="/" charset="gb2312" contentId="00000000-0000-0000-0000-000000000000" contentLocation=""&gt;xOO6w8TayN0=&lt;/content&gt;&lt;/masmms&gt;</content><extendCode>0101</extendCode><applicationId>DefaultApplication</applicationId><password/><expectSendTime>2011-02-18T19:11:31.3093084+08:00</expectSendTime></SendMessage4></s:Body></s:Envelope>


public string AddTask(PeriodType periodType, PeriodValue periodValue, PeriodTime periodTime, string[] destinationAddresses, string subject, string content, string extendCode, string applicationId, string password)
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><AddTask3 xmlns="http://openmas.chinamobile.com/mms"><periodType>Month</periodType><periodValue xmlns:a="http://schemas.datacontract.org/2004/07/OpenMas" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:day>2</a:day><a:month>0</a:month><a:week>Sunday</a:week></periodValue><periodTime xmlns:a="http://schemas.datacontract.org/2004/07/OpenMas" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:hour>17</a:hour><a:minute>12</a:minute><a:second>11</a:second></periodTime><destinationAddresses xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:string>13429614889</a:string></destinationAddresses><subject>......</subject><content>&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;masmms&gt;&lt;content contentType="/" charset="gb2312" contentId="00000000-0000-0000-0000-000000000000" contentLocation=""&gt;xOO6w8TayN0=&lt;/content&gt;&lt;/masmms&gt;</content><extendCode>0101</extendCode><applicationId>DefaultApplication</applicationId><password/></AddTask3></s:Body></s:Envelope>


public string AddTask(PeriodType periodType, PeriodValue periodValue, PeriodTime periodTime, string[] destinationAddresses,string subject, string content, string extendCode, string applicationId, string password, DateTime beginTime, DateTime endTime)
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><AddTask4 xmlns="http://openmas.chinamobile.com/mms"><periodType>Month</periodType><periodValue xmlns:a="http://schemas.datacontract.org/2004/07/OpenMas" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:day>2</a:day><a:month>0</a:month><a:week>Sunday</a:week></periodValue><periodTime xmlns:a="http://schemas.datacontract.org/2004/07/OpenMas" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:hour>17</a:hour><a:minute>12</a:minute><a:second>11</a:second></periodTime><destinationAddresses xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:string>13429614889</a:string></destinationAddresses><subject>......</subject><content>&lt;?xml version="1.0" encoding="utf-8"?&gt;&lt;masmms&gt;&lt;content contentType="/" charset="gb2312" contentId="00000000-0000-0000-0000-000000000000" contentLocation=""&gt;xOO6w8TayN0=&lt;/content&gt;&lt;/masmms&gt;</content><extendCode>0101</extendCode><applicationId>DefaultApplication</applicationId><password/><beginTime>2011-02-18T18:19:50.822879+08:00</beginTime><endTime>2011-03-18T00:00:00</endTime></AddTask4></s:Body></s:Envelope>

public void RemoveTask(string taskId)
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><RemoveTask xmlns="http://openmas.chinamobile.com/mms"><taskId>ef5d6da2-4ca3-48a0-97d8-ea4d74257f99</taskId></RemoveTask></s:Body></s:Envelope>

public MmsMessage GetMessage(string messageId)
发送报文
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetMessage xmlns="http://openmas.chinamobile.com/mms"><messageId>933b4057-1a17-4879-b0ab-32e3001864d0</messageId></GetMessage></s:Body></s:Envelope>
接收报文

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body><GetMessageResponse xmlns="http://openmas.chinamobile.com/mms"><GetMessageResult i:nil="true" xmlns:a="http://schemas.datacontract.org/2004/07/OpenMas" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"/></GetMessageResponse></s:Body></s:Envelope>